blogs/perf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-21 日 16:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>perf简介</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">perf简介</h1>
<p>
perf是linux下的性能分析工具，主要有以下功能：
</p>
<ol class="org-ol">
<li>采集机器的pmu指标，分析程序的微架构特征，例如IPC、cache命中率;</li>
<li>分析程序热点、性能瓶颈。</li>
</ol>

<div id="outline-container-orgc95920a" class="outline-2">
<h2 id="orgc95920a"><span class="section-number-2">1</span> perf 的安装</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7b9def3" class="outline-3">
<h3 id="org7b9def3"><span class="section-number-3">1.1</span> 软件包安装</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>centos环境 <code>yum install perf</code></li>
<li>ubuntu环境 <code>apt-get install linux-tools-common linux-tools-generic linux-tools-$(uname -r)</code></li>
</ol>
</div>
</div>

<div id="outline-container-org460416b" class="outline-3">
<h3 id="org460416b"><span class="section-number-3">1.2</span> 从源码安装</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">centos &#29615;&#22659;</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#20934;&#22791;gcc &gt;= 8.5.0&#65292;&#20294;&#26159;gcc&#29256;&#26412;&#22826;&#39640;&#20063;&#19981;&#34892;&#65288;gcc12&#65289;&#65292;&#38169;&#35823;&#26816;&#26597;&#26356;&#20005;&#26684;</span>
yum install centos-release-scl devtoolset-7-gcc -y
scl enable devtoolset-7 bash

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#23433;&#35013;&#20381;&#36182;</span>
yum install elfutils-devel binutils-devel numactl-devel libcap-devel -y

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#19979;&#36733;linux&#28304;&#30721;</span>
curl -LO https://cdn.kernel.org/pub/linux/kernel/v5.x/linux-5.16.15.tar.xz &amp;&amp; tar xJf linux-5.16.15.tar.xz
<span style="color: #b0c4de;">cd</span> linux-5.16.15/tools/perf &amp;&amp; make -j $(<span style="color: #fa8072;">nproc</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga16aabb" class="outline-2">
<h2 id="orga16aabb"><span class="section-number-2">2</span> perf的对象</h2>
<div class="outline-text-2" id="text-2">
<p>
perf的对象可以是系统、CPU、进程，不同对象可以取交集。
</p>
<ol class="org-ol">
<li><code>-a</code> 对系统的所有进程、所有CPU;</li>
<li><code>-C</code> 对指定CPU，一个或多个，例如： <code>-C 1,3,5,9-15</code> ;</li>
<li><code>-p</code> 对指定的进程，一个或多个，逗号分割;</li>
<li><code>-t</code> 对指定的线程，一个或多个，指定线程时，必须同时用 <code>-p</code> 指定进程;</li>
<li><code>-C</code> <code>-p</code> 同时指定CPU、进程。</li>
</ol>

<p>
perf的对象越多，perf的损耗越多，perf对象的数量如何计算呢？
</p>
<ol class="org-ol">
<li><code>-a</code> <code>-C</code> perf 对象和CPU数量一样;</li>
<li><code>-p</code> perf对象等于 <code>CPU数量*进程的线程数量</code> 这个数量可能非常大。</li>
</ol>
</div>
</div>

<div id="outline-container-org21c0583" class="outline-2">
<h2 id="org21c0583"><span class="section-number-2">3</span> perf event</h2>
<div class="outline-text-2" id="text-3">
<p>
CPU本身有性能计数器（PMU），通过采集PMU的信息，可以评估（程序在）CPU的执行效率、内存带宽等。
perf 通过event选择对应的PMU，例如： <code>instructions、cycles、branches</code> 。
</p>

<p>
每个CPU的PUM数量是固定的，其中2个不可编程，用于采集cycles、instrctions，剩下的可用编程，用于指定对应的event。
如果采集的event数量多于PMU数量，perf会采用分时复用的方式使用PMU，准确性会下降。
</p>

<p>
<b>备注</b>
</p>
<ol class="org-ol">
<li>event 是和CPU密切相关的，AMD和INTEL有很大不同，INTEL的不同CPU架构之间也有不小差异;</li>
<li>event 是最原始的指标，需要组合原始指标才能得到更有意义的指标，例如： <code>ipc = instructions/cycles</code>;</li>
</ol>
</div>

<div id="outline-container-orgf46ad97" class="outline-3">
<h3 id="orgf46ad97"><span class="section-number-3">3.1</span> event的指定</h3>
<div class="outline-text-3" id="text-3-1">
<p>
1、通过event的名称
</p>

<p>
<code>perf list</code> 用于列出所有的event，这个列表很长（取绝于perf的版本）
</p>

<p>
2、通过pmu事件号
</p>

<p>
例如： <code>cpu/event=0xd3,umask=0x2,name=remote_dram/</code> 用于intel skylake架构，采集跨socket内存访问的次数。
</p>

<p>
<a href="https://github.com/intel/perfmon">perfmon</a> 可以查到INTEL支持的事件，各个事件的含义。
</p>
</div>
</div>

<div id="outline-container-org79220b7" class="outline-3">
<h3 id="org79220b7"><span class="section-number-3">3.2</span> event组</h3>
<div class="outline-text-3" id="text-3-2">
<p>
如前所讲，PMU可能会分时复用，可以控制每个分时的event， <code>-e '{event1,event2,event3,event4}'</code> 。
</p>
</div>
</div>
</div>

<div id="outline-container-orgc5d068b" class="outline-2">
<h2 id="orgc5d068b"><span class="section-number-2">4</span> perf stat</h2>
<div class="outline-text-2" id="text-4">
<p>
perf stat 用于采集PMU信息，用于分析程序使用硬件的效率，最重要的是IPC。这涉及到微架构的内容，需要专门的文章总结。
</p>
</div>

<div id="outline-container-org8a7c550" class="outline-3">
<h3 id="org8a7c550"><span class="section-number-3">4.1</span> 基本用法</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><code>perf stat -p &lt;pid&gt; --timeout &lt;ms&gt;</code> 采集pid的基本信息，采集时长ms;</li>
<li><code>perf stat -e cycles:k,instructions:k -p &lt;pid&gt; -- sleep &lt;sec&gt;</code> 采集pid内核的指令，采集时长sec;</li>
<li><code>perf stat -- test</code> 运行test，采集基本信息。</li>
</ol>
</div>
</div>

<div id="outline-container-org7b5c638" class="outline-3">
<h3 id="org7b5c638"><span class="section-number-3">4.2</span> 输出介绍</h3>
<div class="outline-text-3" id="text-4-2">
<p>
下面是采集进程3926信息10秒的情况，整体分三部分：
</p>
<ol class="org-ol">
<li>#号前是采集的值、名称，是从PMU读取的;</li>
<li>#号后是计算的值，是根据PMU和其它信息计算的值;</li>
<li>括号中表示分时复用的情况。</li>
</ol>

<p>
例如：2.882 GHz 是CPU的频率，这个是计算的，不是采集的。
</p>

<pre class="example">
$ sudo perf stat -p 3926 -- sleep 10

 Performance counter stats for process id '261662':

      18810.424285      task-clock (msec)         #    1.875 CPUs utilized
            95,633      context-switches          #    0.005 M/sec
            19,360      cpu-migrations            #    0.001 M/sec
           149,140      page-faults               #    0.008 M/sec
    54,206,371,162      cycles                    #    2.882 GHz                      (98.05%)
    41,497,287,682      instructions              #    0.77  insn per cycle           (98.84%)
     7,903,861,194      branches                  #  420.185 M/sec                    (97.91%)
       140,183,559      branch-misses             #    1.77% of all branches          (97.12%)

      10.033397285 seconds time elapsed
</pre>

<p>
<b>备注</b>
</p>
<ol class="org-ol">
<li>因为要操作硬件 <code>perf stat</code> 和内核版本关系密切，在新CPU上perf stat的（一些）功能可能无法使用;</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org4f61e0a" class="outline-2">
<h2 id="org4f61e0a"><span class="section-number-2">5</span> perf record</h2>
<div class="outline-text-2" id="text-5">
<p>
perf record 用于采样程序的运行情况，包括程序的函数、调用栈（含内核）。
perf使用event作为事件源，按照一定的频率采样，记录采样时的函数，记录的次数越多，说明函数占比越大。
</p>

<p>
默认使用cycles采样，此时采样得到的就是函数耗时，传统意义上的火焰图。也可以使用l3-miss的event采样，得到的是函数l3-miss的耗时，用于优化内存访问。
</p>
</div>

<div id="outline-container-org56dcea1" class="outline-3">
<h3 id="org56dcea1"><span class="section-number-3">5.1</span> perf record</h3>
<div class="outline-text-3" id="text-5-1">
<p>
采样程序的运行情况，常用参数：
</p>
<ol class="org-ol">
<li><code>-g</code> 记录程序调用栈;</li>
<li><code>-o</code> 指定输出文件，默认是perf.data;</li>
<li><code>-F</code> 采用频率。</li>
</ol>
</div>
</div>

<div id="outline-container-org9d61e02" class="outline-3">
<h3 id="org9d61e02"><span class="section-number-3">5.2</span> perf report</h3>
<div class="outline-text-3" id="text-5-2">
<p>
查看perf record的结果，常用参数：
</p>
<ol class="org-ol">
<li><code>-g none --no-children</code> 不查看调用栈</li>
<li><code>-d &lt;dso&gt;</code> 查看该dso的符号</li>
</ol>

<p>
搜索特定符号的占比
<code>perf report | grep -F'%' | tr -d'%' | awk '{sum += $1} END {print sum}'</code>
</p>
</div>
</div>

<div id="outline-container-org3b4562a" class="outline-3">
<h3 id="org3b4562a"><span class="section-number-3">5.3</span> perf top</h3>
<div class="outline-text-3" id="text-5-3">
<p>
函数调用top（类比top命令），相当于一边record一边report，比较消耗资源。
</p>
</div>
</div>

<div id="outline-container-org84b1032" class="outline-3">
<h3 id="org84b1032"><span class="section-number-3">5.4</span> perf annotate</h3>
<div class="outline-text-3" id="text-5-4">
<p>
查看函数内部热点，例如：perf report显示foo函数占比大，可以用 <code>perf annotate foo</code> 显示函数foo内部哪段代码占比多，默认显示汇编，如果有源码，也会关联上源码。
</p>

<p>
但通常不怎么用，在使用perf record时，移动光标到foo函数，敲enter，就可以对foo做annotate。
</p>
</div>
</div>

<div id="outline-container-orgc26c073" class="outline-3">
<h3 id="orgc26c073"><span class="section-number-3">5.5</span> perf script</h3>
<div class="outline-text-3" id="text-5-5">
<p>
解码、输出 perf record 的数据。
</p>
</div>
</div>

<div id="outline-container-org36fdc1d" class="outline-3">
<h3 id="org36fdc1d"><span class="section-number-3">5.6</span> 火焰图</h3>
<div class="outline-text-3" id="text-5-6">
<p>
如果不习惯perf report的文本界面，可以转成火焰图，（perf record时需要-g参数）。
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#38656;&#35201;&#29992;&#21040;&#28779;&#28976;&#22270;&#24037;&#20855;&#65306;https://github.com/brendangregg/FlameGraph.git</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#37319;&#38598;30&#31186;</span>
perf record -g -p &lt;pid&gt; -o perfdata -- sleep 30

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">perf script &#35299;&#30721;perfdata</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">stackcollapse-perf.pl&#65288;&#26469;&#33258;FlameGraph&#65289;&#65292;&#25226;perf script&#30340;&#36755;&#20986;&#36716;&#25104;&#28779;&#28976;&#22270;&#38656;&#35201;&#30340;&#25991;&#26412;&#26684;&#24335;</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">flamegraph.pl &#25226;&#28779;&#28976;&#22270;&#25991;&#26412;&#36716;&#25104;&#28779;&#28976;&#22270;</span>
perf script -i perfdata | stackcollapse-perf.pl | flamegraph.pl &gt; perf.svg

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#21487;&#20197;&#22312;stackcollapse&#20043;&#21069;&#65292;&#21152;&#24037;&#25991;&#26412;</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#20363;&#22914;&#65306;&#21024;&#38500;unknow&#26632;&#65292;&#19981;&#21306;&#20998;&#32447;&#31243;</span>
perf script -i perfdata | grep -vF <span style="color: #ffa07a;">'[unknown]'</span> | sed -E <span style="color: #ffa07a;">'s/^[a-zA-Z0-9:_-]+/thread/'</span> | stackcollapse-perf.pl | flamegraph.pl &gt; perf.svg
</pre>
</div>

<p>
注意事项：
</p>

<ol class="org-ol">
<li>为了展示内联函数， 为 <code>perf record</code> 指定 <code>--call-graph dwarf</code> 参数，使用dwarf来爬栈。但是会导致 perf.data 文件巨大，可用通过-F降低采样频率;</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgb8c349d" class="outline-2">
<h2 id="orgb8c349d"><span class="section-number-2">6</span> 常见问题</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga483b9d" class="outline-3">
<h3 id="orga483b9d"><span class="section-number-3">6.1</span> Too many events are opened</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<code>perf stat</code> <code>perf record</code> 指定 <code>-p</code> 需要为进程的每个线程，每个CPU调用 <code>perf_event_open</code> 当线程数量较多，机器CPU数量较多时，会消耗大量fd（例如：5000线程、256个cpu，消耗128万），超出ulimit的限制。此时直接修改ulimit是不行的，需要先修改 <code>fs.nr_open</code> 。
</p>

<pre class="example">
$ perf record -e cycles:k -p 7921 -- sleep 30
Too many events are opened
Probably the maximum number of open file descriptors has been reached.
Hint: Try again after reducing the number of events.
Hint: Try increasing the limit with 'ulimit -n &lt;limit&gt;'

$ ulimit -n 2560000
-bash: ulimit: open files: cannot modify limit: Operation not permitted

# ulimit -n 修改失败，需要先修改 fs.nr_open
$ sysctl -w fs.nr_open=2560000
</pre>
</div>
</div>

<div id="outline-container-org7974e3c" class="outline-3">
<h3 id="org7974e3c"><span class="section-number-3">6.2</span> perf script 调用栈频率</h3>
<div class="outline-text-3" id="text-6-2">
<p>
perf script 输出调用栈，不能只看栈的输出频次，有个 period 字段，表示每个栈的耗时。FlameGraph 有个 <a href="https://github.com/brendangregg/FlameGraph/issues/165">issue</a> 讨论这个问题。
</p>
</div>
</div>

<div id="outline-container-org05f71f3" class="outline-3">
<h3 id="org05f71f3"><span class="section-number-3">6.3</span> 全量采集、单独展示</h3>
<div class="outline-text-3" id="text-6-3">
<p>
如上所述，指定pid采集不见得开销就小，可以用 <code>-a</code> 全量采集，然后在perf report、perf script时指定 <code>--pid</code> 只展示单独的进程。
</p>
</div>
</div>

<div id="outline-container-orge83ac86" class="outline-3">
<h3 id="orge83ac86"><span class="section-number-3">6.4</span> Java程序的符号</h3>
<div class="outline-text-3" id="text-6-4">
<p>
对于解释性语言而言，通常perf抓到的地址是解释器的、而不是被解释程序自身的。带JIT的语言（如Java）抓到的地址是JIT后的程序的，但是地址和符号的映射关系需要JIT单独提供。perf 在解析进程 <code>&lt;pid&gt;</code> 符号时，会访问 <code>/tmp/perf-&lt;pid&gt;.map</code> 。JIT提供的映射关系放到这个地址即可。
</p>

<p>
Java17提供了导出JIT符号的方法。 <code>jcmd &lt;pid&gt; Compiler.perfmap</code> 。
</p>
</div>
</div>

<div id="outline-container-org935fedd" class="outline-3">
<h3 id="org935fedd"><span class="section-number-3">6.5</span> 容器中使用perf的问题</h3>
<div class="outline-text-3" id="text-6-5">
<p>
容器通常没有root权限，需要配置sysctl采集内核符号， <code>sysctl -w kernel.perf_event_paranoid=-1</code> 。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2024-04-21 日 16:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
